Revit 2027 API
Toposolid.ExcavateBy Method
 Excavates the Toposolid by a given element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void ExcavateBy(
	ElementId elementId
)
Public Sub ExcavateBy (
	elementId As ElementId
)
public:
void ExcavateBy(
	ElementId^ elementId
)
member ExcavateBy :
        elementId : ElementId -> unit
Parameters
elementId ElementId
 Id of the element used to excavate the Toposolid.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The element is not supported for Toposolid excavation operations.
See Also
Reference
Toposolid Class
Autodesk.Revit.DB Namespace